Repository: bekhzod0830/svayp_mobile
Catalog: lib/l10n/app_*.arb
Languages: uz

source: Cancel
uz: Bekor qilish

source: Save
uz: Saqlash

source: Delete
uz: O'chirish

source: Edit
uz: Tahrirlash

source: Add
uz: Qo'shish

source: Confirm
uz: Tasdiqlash

source: Yes
uz: Ha

source: No
uz: Yo'q

# enterSizesForBetterRecommendations
source: Enter your sizes for better recommendations
uz: Yaxshiroq tavsiyalar uchun o'lchamlaringizni kiriting

# whatSizesTypicallyWear
source: What sizes do you typically wear?
uz: Odatda qanday o'lchamlarda kiyasiz?

# helpsShowPerfectlyFittedItems
source: This helps us show you perfectly fitted items
uz: Bu sizga mukammal mos keluvchi narsalarni ko'rsatishga yordam beradi

source: Tops
uz: Ustki kiyim

source: Bottoms
uz: Ostki kiyimlar

source: Dresses
uz: Ko'ylaklar

source: Jean Waist
uz: Jinsi bel

source: Bra Band
uz: Lif hajmi

source: Bra Cup
uz: Lif kosasi

source: Shoe Size
uz: Poyabzal o'lchami

source: Budget Preference
uz: Byudjet afzalligi

source: Search
uz: Qidirish

source: Filter
uz: Filtr

source: Sort
uz: Saralash

source: Apply
uz: Qo'llash

source: Reset
uz: Qayta tiklash

source: Done
uz: Tayyor

source: Next
uz: Keyingi

source: Back
uz: Ortga

source: Skip
uz: O'tkazib yuborish

source: Loading...
uz: Yuklanmoqda...

source: Error
uz: Xatolik

source: Success
uz: Muvaffaqiyatli

source: Try Again
uz: Qayta urinib ko'ring

source: Close
uz: Yopish

# welcomeToSwipe
source: Welcome to SVAYP
uz: SVAYP ga xush kelibsiz

# discoverYourStyle
source: Discover your perfect style with AI-powered fashion recommendations
uz: AI asosidagi moda tavsiflari bilan o'z stilingizni kashf eting

source: Phone Number
uz: Telefon raqami

# enterPhoneNumber
source: Enter your phone number
uz: Telefon raqamingizni kiriting

source: Select Language
uz: Tilni tanlang

# continueText
source: Continue
uz: Davom etish

source: Verification Code
uz: Tasdiqlash kodi

# enterVerificationCode
source: Enter the verification code sent to
uz: Yuborilgan tasdiqlash kodini kiriting

source: Resend Code
uz: Kodni qayta yuborish

source: Verify
uz: Tasdiqlash

source: Verifying...
uz: Tekshirilmoqda...

source: Invalid phone number
uz: Noto'g'ri telefon raqami

source: Invalid verification code
uz: Noto'g'ri tasdiqlash kodi

source: Discover
uz: Kashf etish

source: For You
uz: Siz uchun

source: Swipe Right to Like
uz: Yoqtirish uchun o'ngga suring

source: Swipe Left to Pass
uz: O'tkazish uchun chapga suring

source: Swipe up to add to cart
uz: Savatga qo'shish uchun yuqoriga suring

source: Added to cart!
uz: Savatga qo'shildi!

source: View Cart
uz: Savatni ko'rish

source: Failed to load products
uz: Mahsulotlarni yuklashda xatolik

source: Passed
uz: O'tkazildi

source: Added to liked!
uz: Yoqtirilganlarga qo'shildi!

source: Liked
uz: Yoqtirilgan

source: Liked Items
uz: Yoqtirilgan mahsulotlar

source: Saved
uz: Saqlangan

source: No Liked Items Yet
uz: Hali yoqtirilgan mahsulotlar yo'q

# startSwipingAndSave
source: Start swiping and save items you love
uz: Surishni boshlang va yoqtirgan narsalaringizni saqlang

source: Start Exploring
uz: Tadqiq qilishni boshlash

source: Clear All
uz: Hammasini tozalash

source: Cleared all liked items
uz: Barcha yoqtirilgan mahsulotlar tozalandi

source: Removed {item}
uz: {item} o'chirildi

source: Undo
uz: Bekor qilish

# undoNotImplemented
source: Undo feature not implemented yet
uz: Bekor qilish funksiyasi hali ishlab chiqilmagan

source: Remove from liked?
uz: Yoqtirganlardan o'chirish?

# removeFromLikedMessage
source: Are you sure you want to remove this item from your liked collection?
uz: Bu mahsulotni yoqtirganlar ro'yxatidan o'chirishga ishonchingiz komilmi?

source: Remove
uz: O'chirish

source: Shop
uz: Do'kon

source: Categories
uz: Kategoriyalar

source: All
uz: Hammasi

source: Clothing
uz: Kiyim

source: Shoes
uz: Poyafzal

source: Accessories
uz: Aksessuarlar

source: Coverage
uz: Qoplam

source: Covered
uz: Yopiq

source: Uncovered
uz: Ochiq

# searchForClothes
source: Ask me anything...
uz: Nimani xohlaysiz...

source: Trending
uz: Trendda

# newItems
source: New
uz: Yangi

source: Sale
uz: Chegirma

# aiScan
source: Visual Search
uz: Visual Qidiruv

source: No products found
uz: Mahsulotlar topilmadi

# tryDifferentFilters
source: Try adjusting your search or filters
uz: Qidiruvni yoki filtrlarni o'zgartirib ko'ring

# tryAdjustingFilters
source: Try adjusting your filters
uz: Filtrlarni sozlab ko'ring

# cart
source: Shopping Cart
uz: Savat

source: My Cart
uz: Mening savatim

# cartEmpty
source: Your cart is empty
uz: Savatingiz bo'sh

source: Start shopping now
uz: Xarid qilishni boshlash

source: Item
uz: Mahsulot

source: Items
uz: Mahsulotlar

source: Subtotal
uz: Oraliq jami

source: Tax
uz: Soliq

source: Delivery
uz: Yetkazib berish

source: Total
uz: Jami

source: Proceed to Checkout
uz: To'lovga o'tish

source: Remove from cart?
uz: Savatdan o'chirish?

# removeFromCartMessage
source: Are you sure you want to remove this item?
uz: Bu mahsulotni o'chirishga ishonchingiz komilmi?

source: Clear Cart
uz: Savatni tozalash

# clearCartMessage
source: Are you sure you want to clear all items from your cart?
uz: Savatdagi barcha mahsulotlarni o'chirishga ishonchingiz komilmi?

source: Product Details
uz: Mahsulot tafsilotlari

source: Size
uz: O'lchami

source: Select Size
uz: O'lchamni tanlang

# selectSizeAndColor
source: Select Size & Color
uz: O'lcham va rang tanlang

source: That's All for Now!
uz: Hozircha hammasi shu!

# findingMoreItems
source: We're finding more items you'll love
uz: Siz uchun yana ko'proq mahsulotlar topamiz

source: Refresh Feed
uz: Lentani yangilash

# pleaseSelectSize
source: Please select a size
uz: Iltimos, o'lchamni tanlang

# pleaseSelectColor
source: Please select a color
uz: Iltimos, rangni tanlang

source: One Size
uz: Bir o'lcham

source: Color
uz: Rang

source: Select Color
uz: Rangni tanlang

source: Quantity
uz: Miqdor

source: Description
uz: Tavsif

source: Reviews
uz: Sharhlar

# reviewsCount
source: {count} reviews
uz: {count} ta sharh

source: See All
uz: Barchasini ko'rish

source: Rating
uz: Reyting

source: Add to Cart
uz: Savatga qo'shish

source: Check Availability
uz: Mavjudligini tekshirish

source: Buy Now
uz: Hozir sotib olish

source: In Stock
uz: Mavjud

source: Out of Stock
uz: Mavjud emas

# newLabel
source: NEW
uz: YANGI

source: Category
uz: Kategoriya

source: Seller
uz: Sotuvchi

source: Availability
uz: Mavjudlik

source: Fit Match
uz: O'lcham mosligi

source: Style Match
uz: Uslub mosligi

source: Added to liked items
uz: Yoqtirilganlarga qo'shildi

source: Removed from liked items
uz: Sevimlilardan olib tashlandi!

# customerReviewPrompt
source: See what other customers are saying about this product
uz: Ushbu mahsulot haqida boshqa mijozlar nimani aytayotganini ko'ring

source: Jan
uz: Yan

source: Feb
uz: Fev

source: Jun
uz: Iyun

source: Jul
uz: Iyul

source: Aug
uz: Avg

source: Sep
uz: Sen

source: Oct
uz: Okt

source: Nov
uz: Noy

source: Dec
uz: Dek

source: Order
uz: Buyurtma

source: Tracking Number
uz: Kuzatuv raqami

source: products
uz: mahsulot

source: All Products
uz: Barcha mahsulotlar

source: Track
uz: Kuzatish

source: Reorder
uz: Qayta buyurtma qilish

source: Tracking coming soon
uz: Kuzatuv tez orada

source: Reorder coming soon
uz: Qayta buyurtma tez orada

# phoneVerificationSubtitle
source: We'll send you a verification code to confirm your number
uz: Raqamingizni tasdiqlash uchun sizga tasdiqlash kodini yuboramiz

source: I agree to the
uz: Men

source: Terms of Service
uz: Xizmat shartlari

source: and
uz: va

source: Privacy Policy
uz: Maxfiylik siyosati

# continueButton
source: Continue
uz: Davom etish

# contactSupport
source: Having trouble? Contact support
uz: Muammo bormi? Qo'llab-quvvatlash bilan bog'laning

# agreeToTermsError
source: Please agree to Terms & Privacy Policy
uz: Iltimos, Shartlar va Maxfiylik siyosatiga rozilik bering

# otpSendError
source: Failed to send OTP. Please try again.
uz: Kod yuborishda xatolik. Qayta urinib ko'ring.

# verifyPhoneNumber
source: Verify your phone number
uz: Telefon raqamingizni tasdiqlang

# enterDigitCode
source: Enter the 6-digit code sent to
uz: 6 raqamli kodni kiriting

# completeOtpError
source: Please enter complete OTP code
uz: Iltimos, to'liq kodni kiriting

# invalidOtpError
source: Invalid OTP. Please try again.
uz: Noto'g'ri kod. Qayta urinib ko'ring.

# otpSentSuccess
source: OTP sent successfully
uz: Kod muvaffaqiyatli yuborildi

# resendOtpError
source: Failed to resend OTP. Please try again.
uz: Kodni qayta yuborishda xatolik. Qayta urinib ko'ring.

# resendCodeIn
source: Resend code in {seconds} seconds
uz: Kodni qayta yuborish {seconds} soniyadan keyin

source: Wrong number?
uz: Noto'g'ri raqammi?

source: Tell us about yourself
uz: O'zingiz haqida gapirib bering

# personalizeExperience
source: This helps us personalize your experience
uz: Bu sizning tajribangizni shaxsiylashtirish uchun yordam beradi

source: Full Name
uz: To'liq ism

source: Enter your name
uz: Ismingizni kiriting

source: Gender
uz: Jins

source: Male
uz: Erkak

source: Female
uz: Ayol

source: Date of Birth
uz: Tug'ilgan sana

source: Day
uz: Kun

source: Month
uz: Oy

source: Year
uz: Yil

source: January
uz: Yanvar

source: February
uz: Fevral

source: March
uz: Mart

source: April
uz: Aprel

source: June
uz: Iyun

source: July
uz: Iyul

source: August
uz: Avgust

source: September
uz: Sentyabr

source: October
uz: Oktyabr

source: November
uz: Noyabr

source: December
uz: Dekabr

# selectBirthDate
source: Please select your date of birth
uz: Iltimos, tug'ilgan sanangizni tanlang

# selectGenderError
source: Please select your gender
uz: Iltimos, jinsingizni tanlang

# selectDateError
source: Please select your date of birth
uz: Iltimos, tug'ilgan sanangizni tanlang

# saveInfoError
source: Failed to save info. Please try again.
uz: Ma'lumotni saqlashda xatolik. Qayta urinib ko'ring.

source: Your Style Preference
uz: Sizning uslub afzalligingiz

# relevantFashionChoices
source: This helps us show you the most relevant fashion choices
uz: Bu sizga eng mos moda tanlovlarini ko'rsatishga yordam beradi

# modestFashionHijab
source: Modest fashion with Hijab
uz: Hijob bilan kamtar moda

source: Traditional fashion styles
uz: An'anaviy moda uslublari

# selectPreferenceError
source: Please select your preference
uz: Iltimos, afzalligingizni tanlang

# savePreferenceError
source: Failed to save preference. Please try again.
uz: Afzallikni saqlashda xatolik. Qayta urinib ko'ring.

# primaryObjective
source: What's your primary objective?
uz: Sizning asosiy maqsadingiz nima?

# selectWhatMatters
source: Select what matters most to you when shopping for fashion
uz: Moda uchun xarid qilishda siz uchun eng muhim narsani tanlang

# havingOwnStylist
source: Having my own Stylist
uz: O'z stilistiga ega bo'lish

# findBestFit
source: Find my best fit
uz: Eng yaxshi moslikni topish

# funSurprise
source: A fun surprise
uz: Qiziqarli syurpriz

source: Unique pieces
uz: Noyob buyumlar

# updateLook
source: Update my look
uz: Ko'rinishimni yangilash

source: Save time shopping
uz: Xarid qilishda vaqt tejash

source: Try new trends
uz: Yangi trendlarni sinab ko'rish

# browsePersonalizedShop
source: Browse a personalized shop
uz: Shaxsiylashtirilgan do'konni ko'rib chiqish

# selectObjectiveError
source: Please select an objective
uz: Iltimos, maqsadni tanlang

# saveObjectiveError
source: Failed to save objective. Please try again.
uz: Maqsadni saqlashda xatolik. Qayta urinib ko'ring.

source: Fit Preference
uz: O'tirish tanlovi

# howDoYouPreferClothesToFit
source: How do you prefer your clothes to fit?
uz: Kiyimingiz qanday o'tirishini afzal ko'rasiz?

source: Loose
uz: Keng

source: Comfortable, relaxed fit
uz: Qulay, erkin o'lcham

source: Regular
uz: Oddiy

source: Standard, comfortable fit
uz: Standart, qulay o'lcham

source: Tight
uz: Torroq

source: Form-fitting, tailored look
uz: Tana bo'ylab, tikilgan ko'rinish

# selectFitError
source: Please select a fit preference
uz: Iltimos, o'lcham afzalligini tanlang

# saveFitError
source: Failed to save fit preference. Please try again.
uz: O'lcham afzalligini saqlashda xatolik. Qayta urinib ko'ring.

source: Size Profile
uz: O'lcham profili

# helpUsRecommendPerfectSizes
source: Help us recommend the perfect sizes for you
uz: Siz uchun mukammal o'lchamlarni topishga yordam bering

source: Height
uz: Bo'y

source: Weight
uz: Vazn

source: Body Type
uz: Tana turi

# selectBodyTypeHelpRecommend
source: Select your body type to help us recommend the most flattering styles
uz: Eng mos uslublarni taklif qilish uchun tana turingizni tanlang

source: Hourglass
uz: Qum soati

# hourglassDescription
source: Waist is the narrowest part of frame
uz: Bel tananing eng tor qismi

source: Triangle
uz: Uchburchak

# triangleDescription
source: Hips are broader than shoulders
uz: Sonlar yelkalardan kengroq

source: Rectangle
uz: To'rtburchak

# rectangleDescription
source: Hips, shoulders and waist are the same proportion
uz: Sonlar, yelkalar va bel bir xil nisbatda

# ovalDescription
source: Hips and shoulders are narrower than waist
uz: Sonlar va yelkalar beldan torroq

source: Heart
uz: Yurak

# heartDescription
source: Hips are narrower than shoulders
uz: Sonlar yelkalardan torroq

# selectBodyTypeError
source: Please select your body type
uz: Iltimos, tana turingizni tanlang

# saveBodyTypeError
source: Failed to save body type. Please try again.
uz: Tana turini saqlashda xatolik. Qayta urinib ko'ring.

source: Your Sizes
uz: Sizning o'lchamlaringiz

# whatsYourIdealPriceRange
source: What's your ideal price range for fashion items?
uz: Moda buyumlari uchun ideal narx oralig'ingiz qanday?

source: What's your budget range?
uz: Byudjet oralig'ingiz qanday?

# showItemsWithinPriceRange
source: We'll show you items within your price range
uz: Sizga narx oralig'ingiz doirasidagi narsalarni ko'rsatamiz

source: Budget Friendly
uz: Byudjetli

# under500k
source: Under 500,000 UZS
uz: 500 000 so'mgacha

source: Moderate
uz: O'rtacha

# range500kTo1500k
source: 500,000 - 1,500,000 UZS
uz: 500 000 - 1 500 000 so'm

# range1500kTo3000k
source: 1,500,000 - 3,000,000 UZS
uz: 1 500 000 - 3 000 000 so'm

source: Luxury
uz: Hashamatli

# over3000k
source: Over 3,000,000 UZS
uz: 3 000 000 so'mdan ortiq

source: Flexible
uz: Moslashuvchan

source: Show me everything
uz: Hamma narsani ko'rsating

# changeAnytimeInSettings
source: You can change this anytime in settings
uz: Buni istalgan vaqtda sozlamalarda o'zgartirishingiz mumkin

# selectBudgetError
source: Please select a budget range
uz: Iltimos, byudjet oralig'ini tanlang

# saveBudgetError
source: Failed to save budget preference. Please try again.
uz: Byudjet afzalligini saqlashda xatolik. Qayta urinib ko'ring.

# setBudgetPreferences
source: Set your budget preferences
uz: Byudjet afzalliklarini belgilang

# choosePriceRange
source: Choose your price range for each category
uz: Har bir turkum uchun narx oralig'ini tanlang

# budgetUnder500k
source: Under 500,000 UZS
uz: 500,000 so'mgacha

# budget500kTo1m
source: 500,000 to 1,000,000 UZS
uz: 500,000 - 1,000,000 so'm

# budget1mTo1_5m
source: 1,000,000 to 1,500,000 UZS
uz: 1,000,000 - 1,500,000 so'm

# budget1_5mTo2m
source: 1,500,000 to 2,000,000 UZS
uz: 1,500,000 - 2,000,000 so'm

# budget2mPlus
source: 2,000,000+ UZS
uz: 2,000,000+ so'm

# categoryTops
source: Tops
uz: Ustki kiyimlar

# categoryBottoms
source: Bottoms
uz: Pastki kiyimlar

# categoryJacketsCoats
source: Jackets & Coats
uz: Kurtkalar va paltolar

# categoryDresses
source: Dresses
uz: Ko'ylaklar

# categoryShoes
source: Shoes
uz: Oyoq kiyim

# categoryAccessories
source: Accessories
uz: Aksessuarlar

# categoryJewelry
source: Jewelry
uz: Zargarlik buyumlari

source: Complete Setup
uz: Sozlashni yakunlash

# authenticationRequired
source: Authentication required. Please login first.
uz: Autentifikatsiya talab qilinadi. Iltimos, tizimga kiring.

# pleaseCompleteAllFields
source: Please complete all required fields
uz: Iltimos, barcha majburiy maydonlarni to'ldiring

source: Failed to create profile
uz: Profilni yaratib bo'lmadi

source: Style Quiz
uz: Stil testi

# completeOnboarding
source: Complete Setup
uz: Sozlashni yakunlash

# readyToStartShopping
source: You're all set! Ready to start shopping?
uz: Hammasi tayyor! Xarid qilishga tayyormisiz?

source: Let's Go!
uz: Ketdik!

# completionError
source: Failed to complete setup. Please try again.
uz: Sozlashni yakunlashda xatolik. Qayta urinib ko'ring.

source: You're All Set! 🎉
uz: Hammasi tayyor! 🎉

# preparingYourFeed
source: Preparing your personalized feed...
uz: Shaxsiy lentangiz tayyorlanmoqda...

# startDiscoveringFashion
source: Start discovering fashion made for you
uz: Siz uchun yaratilgan modani kashf qilishni boshlang

source: Similar Products
uz: O'xshash mahsulotlar

source: Visual Search
uz: Vizual qidiruv

source: Visual Search Results
uz: Vizual qidiruv natijalari

source: Search Results
uz: Qidiruv natijalari

source: Sellers
uz: Sotuvchilar

source: products found
uz: mahsulot topildi

# tryDifferentSearch
source: Try searching with different keywords
uz: Boshqa kalit so'zlar bilan qidirishga harakat qiling

source: Your Search Image
uz: Qidiruv uchun rasmingiz

# analyzingImageWithAI
source: Analyzing image with AI... This may take a few seconds
uz: Tasvir AI yordamida tahlil qilinmoqda... Bu bir necha soniya vaqt olishi mumkin

source: AI Analysis
uz: AI tahlili

# similarProductsCount
source: {count} Similar Products
uz: {count} ta o'xshash mahsulot

source: Hijab Appropriate
uz: Hijob uchun mos

# visualSearchFailed
source: Visual search failed: {error}
uz: Vizual qidiruv muvaffaqiyatsiz tugadi: {error}

source: Orders
uz: Buyurtmalar

source: My Orders
uz: Buyurtmalar

source: Order History
uz: Buyurtmalar tarixi

# orderHistoryAppearHere
source: Your order history will appear here
uz: Buyurtmalar tarixingiz shu yerda paydo bo'ladi

source: No Orders Yet
uz: Hali buyurtmalar yo'q

# startShoppingToSeeOrders
source: Start shopping to see your order history here
uz: Buyurtmalar tarixini ko'rish uchun xarid qilishni boshlang

source: Start Shopping
uz: Xarid qilishni boshlash

# itemsCount
source: {count} items
uz: {count} ta mahsulot

source: Total Amount
uz: Umumiy summa

source: View Details
uz: Tafsilotlarni ko'rish

# orderNumber
source: Order #
uz: Buyurtma №

source: Order Date
uz: Buyurtma sanasi

# orderStatus
source: Status
uz: Holati

# orderTotal
source: Total
uz: Jami

source: Track Order
uz: Buyurtmani kuzatish

source: Order Details
uz: Buyurtma tafsilotlari

source: Cancel Order
uz: Buyurtmani bekor qilish

source: Pending
uz: Kutilmoqda

source: Confirmed
uz: Tasdiqlandi

source: Processing
uz: Tayyorlanmoqda

source: Shipped
uz: Yuborildi

source: Out for Delivery
uz: Yo'lda

source: Delivered
uz: Yetkazildi

source: Cancelled
uz: Bekor qilindi

source: Chat
uz: Suhbat

source: No Messages Yet
uz: Hali xabarlar yo'q

# contactSellersFromProduct
source: Contact sellers from product details to ask about availability, sizes, and more
uz: Mavjudligi, o'lchamlari va boshqalar haqida so'rash uchun mahsulot tafsilotlaridan sotuvchilar bilan bog'laning

# aboutProduct
source: About: {productName}
uz: Mahsulot haqida: {productName}

# minutesAgo
source: {minutes}m ago
uz: {minutes} daqiqa oldin

# hoursAgo
source: {hours}h ago
uz: {hours} soat oldin

# daysAgo
source: {days}d ago
uz: {days} kun oldin

source: Yesterday
uz: Kecha

# interestedInProduct
source: Hello! I'm interested in this product. Is it available?
uz: Salom! Men ushbu mahsulot bilan qiziqaman. U mavjudmi?

# sellerAutoResponse
source: Thank you for your message! I'll check and get back to you shortly.
uz: Xabaringiz uchun rahmat! Men tekshirib, tez orada siz bilan bog'lanaman.

# typeMessage
source: Type a message...
uz: Xabar yozing...

# sendMessage
source: Send
uz: Yuborish

source: Checkout
uz: To'lov

source: Shipping Address
uz: Yetkazib berish manzili

source: Delivery Address
uz: Yetkazib berish manzili

source: Select Address
uz: Manzil tanlash

source: No address selected
uz: Manzil tanlanmagan

source: Change Address
uz: Manzilni o'zgartirish

source: Add New Address
uz: Yangi manzil qo'shish

source: Delivery Method
uz: Yetkazib berish usuli

source: Pick up in store
uz: Do'kondan olib ketish

source: Available for pickup
uz: Olib ketish uchun mavjud

source: Standard
uz: Standart

source: Express
uz: Tezkor

source: Same Day
uz: Shu kun

source: business days
uz: ish kunlari

source: Tashkent only
uz: Faqat Toshkent

source: Payment Method
uz: To'lov usuli

source: Select Payment Method
uz: To'lov usulini tanlang

source: No payment method selected
uz: To'lov usuli tanlanmagan

source: Add Payment
uz: To'lov qo'shish

source: Change Payment
uz: To'lovni o'zgartirish

source: Add Payment Method
uz: To'lov usulini qo'shish

# paymentSelectionComingSoon
source: Payment selection feature coming soon
uz: To'lov usulini tanlash funksiyasi tez orada paydo bo'ladi

source: Cash on Delivery
uz: Qabul qilishda naqd

# payWhenYouReceive
source: Pay when you receive your order
uz: Buyurtmani qabul qilganda to'lang

source: Qty
uz: Soni

# pleaseSelectDeliveryAddress
source: Please select a delivery address
uz: Iltimos, yetkazib berish manzilini tanlang

# pleaseSelectPaymentMethod
source: Please select a payment method
uz: Iltimos, to'lov usulini tanlang

source: Order Summary
uz: Buyurtma xulosasi

# orderItems
source: {count} order items
uz: Buyurtmada {count} ta mahsulot

source: Delivery Fee
uz: Yetkazib berish narxi

source: Place Order
uz: Buyurtma berish

# errorPlacingOrder
source: Error placing order: {error}
uz: Buyurtma berishda xatolik: {error}

source: Order Placed!
uz: Buyurtma berildi!

source: Order placed successfully!
uz: Buyurtma muvaffaqiyatli berildi!

# orderConfirmation
source: Your order has been successfully placed
uz: Sizning buyurtmangiz muvaffaqiyatli amalga oshirildi

# orderConfirmedMessage
source: Thank you for your order! We'll send you updates as your order progresses.
uz: Buyurtmangiz uchun rahmat! Buyurtmangiz holati haqida yangilanishlar yuboramiz.

source: Order Confirmed
uz: Buyurtma tasdiqlandi

source: Order ID
uz: Buyurtma ID

source: Continue Shopping
uz: Xaridni davom ettirish

source: Estimated Delivery
uz: Taxminiy yetkazib berish

source: Addresses
uz: Manzillar

source: My Addresses
uz: Mening manzillarim

# noAddressesSaved
source: No addresses saved yet
uz: Hali saqlangan manzillar yo'q

source: No Addresses
uz: Manzillar yo'q

# addDeliveryAddressToContinue
source: Add a delivery address to continue
uz: Davom etish uchun yetkazib berish manzilini qo'shing

# addYourFirstAddress
source: Add your first address for faster checkout
uz: Tez rasmiylashtirish uchun birinchi manzilingizni qo'shing

source: Add Address
uz: Manzil qo'shish

source: Edit Address
uz: Manzilni tahrirlash

source: Delete Address
uz: Manzilni o'chirish

# deleteAddressMessage
source: Are you sure you want to delete this address?
uz: Ushbu manzilni o'chirishga ishonchingiz komilmi?

source: Address deleted
uz: Manzil o'chirildi

source: Default address updated
uz: Asosiy manzil yangilandi

source: Set Default
uz: Asosiy qilish

source: Contact Information
uz: Aloqa ma'lumotlari

source: Enter your full name
uz: To'liq ismingizni kiriting

# pleaseEnterFullName
source: Please enter your full name
uz: Iltimos, to'liq ismingizni kiriting

# phoneNumberShort
source: Phone
uz: Telefon

# phoneNumberLabel
source: Phone Number
uz: Telefon raqami

# pleaseEnterPhoneNumber
source: Please enter your phone number
uz: Iltimos, telefon raqamingizni kiriting

source: Address Information
uz: Manzil ma'lumotlari

source: Street Address
uz: Ko'cha manzili

source: House number and street name
uz: Uy raqami va ko'cha nomi
