Repository: bekhzod0830/svayp_mobile
Catalog: lib/l10n/app_*.arb
Languages: uz

source: Please enter street address
uz: Iltimos, ko'cha manzilini kiriting

source: Apartment/Unit (Optional)
uz: Xonadon/Ofis (Ixtiyoriy)

source: Apt, Suite, Unit, Building
uz: Xonadon, Ofis, Bino

source: Address Line 1
uz: Manzil 1-qator

# addressLine2
source: Address Line 2 (Optional)
uz: Manzil 2-qator (Ixtiyoriy)

source: City
uz: Shahar

source: Select City
uz: Shaharni tanlang

source: Region
uz: Viloyat

source: Region/District
uz: Viloyat/Tuman

source: Select Region
uz: Viloyatni tanlang

source: Postal Code
uz: Pochta indeksi

source: Please enter postal code
uz: Iltimos, pochta indeksini kiriting

source: Landmark (Optional)
uz: Mo'ljal (Ixtiyoriy)

# nearbyLandmarkForDelivery
source: Nearby landmark for easier delivery
uz: Oson yetkazib berish uchun yaqin mo'ljal

# setAsDefault
source: Set as default address
uz: Asosiy manzil qilish

# setAsDefaultAddressDescription
source: This address will be used for all deliveries by default
uz: Ushbu manzil sukut bo'yicha barcha yetkazib berishlar uchun ishlatiladi

# defaultAddress
source: Default
uz: Asosiy

source: Save Address
uz: Manzilni saqlash

source: Update Address
uz: Manzilni yangilash

# errorSavingAddress
source: Error saving address: {error}
uz: Manzilni saqlashda xatolik: {error}

# fillAllFields
source: Please fill all required fields
uz: Iltimos, barcha majburiy maydonlarni to'ldiring

source: Payment Methods
uz: To'lov usullari

source: My Payment Methods
uz: Mening to'lov usullarim

# noPaymentMethods
source: No payment methods added
uz: Qo'shilgan to'lov usullari yo'q

# addYourFirstPaymentMethod
source: Add a payment method for quick checkout
uz: Tez to'lov uchun to'lov usulini qo'shing

source: Pay Online
uz: Onlayn to'lash

source: Card Number
uz: Karta raqami

# cardHolder
source: Cardholder Name
uz: Karta egasining ismi

source: Expiry Date
uz: Amal qilish muddati

source: Save Card
uz: Kartani saqlash

source: Profile
uz: Profil

source: My Profile
uz: Mening profilim

source: Edit Profile
uz: Profilni tahrirlash

# editProfileComingSoon
source: Edit profile feature coming soon
uz: Profilni tahrirlash funksiyasi tez orada paydo bo'ladi

# personalInfo
source: Personal Information
uz: Shaxsiy ma'lumotlar

source: Account
uz: Hisob

source: Saved Items
uz: Saqlangan mahsulotlar

source: Account Settings
uz: Hisob sozlamalari

source: Language
uz: Til

source: Change Language
uz: Tilni o'zgartirish

# paymentMethodsComingSoon
source: Payment methods feature coming soon
uz: To'lov usullari tez orada paydo bo'ladi

source: Preferences
uz: Afzalliklar

source: Dark Mode
uz: Qorong'i rejim

source: Notifications
uz: Bildirishnomalar

# notificationsComingSoon
source: Notifications feature coming soon
uz: Bildirishnomalar tez orada paydo bo'ladi

source: Style Preferences
uz: Stil tanlovlari

# stylePreferencesComingSoon
source: Style preferences feature coming soon
uz: Uslub afzalliklari tez orada paydo bo'ladi

source: Support
uz: Qo'llab-quvvatlash

source: Help Center
uz: Yordam markazi

# helpCenterComingSoon
source: Help center feature coming soon
uz: Yordam markazi tez orada paydo bo'ladi

source: About Us
uz: Biz haqimizda

# termsAndConditions
source: Terms & Conditions
uz: Shartlar va qoidalar

# termsOfServiceComingSoon
source: Terms of service feature coming soon
uz: Xizmat shartlari tez orada paydo bo'ladi

# privacyPolicyComingSoon
source: Privacy policy feature coming soon
uz: Maxfiylik siyosati tez orada paydo bo'ladi

# helpAndSupport
source: Help & Support
uz: Yordam va qo'llab-quvvatlash

source: Logout
uz: Chiqish

# logoutConfirmation
source: Are you sure you want to logout?
uz: Chiqishga ishonchingiz komilmi?

# logoutMessage
source: Are you sure you want to logout?
uz: Chiqishga ishonchingiz komilmi?

# version
source: Version {version}
uz: Versiya {version}

source: Tashkent
uz: Toshkent

source: Samarkand
uz: Samarqand

source: Bukhara
uz: Buxoro

source: Andijan
uz: Andijon

source: Fergana
uz: Farg'ona

source: Karshi
uz: Qarshi

source: Termez
uz: Termiz

source: Urgench
uz: Urganch

source: Kokand
uz: Qo'qon

source: Jizzakh
uz: Jizzax

source: Standard Delivery
uz: Standart yetkazib berish

# standardDeliveryDesc
source: 5-7 business days
uz: 5-7 ish kunlari

source: Express Delivery
uz: Tezkor yetkazib berish

# expressDeliveryDesc
source: 2-3 business days
uz: 2-3 ish kunlari

source: Same Day Delivery
uz: Shu kun yetkazib berish

# sameDayDeliveryDesc
source: Order before 12 PM
uz: Soat 12:00 gacha buyurtma bering

source: Free
uz: Bepul

source: Pass
uz: O'tkazish

source: Info
uz: Ma'lumot

source: Like
uz: Yoqdi

source: Analyzing your style...
uz: Sizning uslubingizni tahlil qilmoqdamiz...

source: Got it
uz: Tushundim

source: Discover your style preference
uz: O'zingizning uslub afzalliklaringizni kashf eting

source: Casual Wear
uz: Kundalik kiyim

source: Business Formal
uz: Rasmiy uslub

source: Streetwear
uz: Ko'cha

source: Athletic Wear
uz: Sport kiyimi

source: Vintage Fashion
uz: Vintage moda

source: Minimalist
uz: Minimalizm

source: Bold Patterns
uz: Yorqin naqshlar

source: Bohemian
uz: Bogemiya

source: Elegant Evening
uz: Elegant kechki

source: Smart Casual
uz: Aqlli kazhual

source: Modern Chic
uz: Zamonaviy chiroyli

source: Classic Style
uz: Klassik uslub

source: Trendy
uz: Moda

source: Sporty
uz: Sportiv

source: Sophisticated
uz: Nafis

source: Comfortable
uz: Qulay

source: Dressy
uz: Bayramona

source: Everyday
uz: Har kunlik

source: Weekend
uz: Dam olish kuni

source: Office
uz: Ofis

source: Evening
uz: Kechki

source: Casual Chic
uz: Kazhual chik

source: Urban
uz: Shahar

source: Contemporary
uz: Zamonaviy

source: Timeless
uz: Abadiy

source: Fashion Forward
uz: Avangard

source: Relaxed
uz: Dam olgan

source: Polished
uz: Sayqallangan

source: Effortless
uz: Bemalol

source: Statement
uz: Yorqin

source: Bra
uz: Sutyen

source: Band
uz: Bel aylanasi

source: Cup
uz: Kosecha

# swipeRightDescription
source: See something you love? Swipe right to save it to your liked items.
uz: Yoqtirayotgan narsangizni ko'rdingizmi? O'ngga suring va yoqtirgan mahsulotlaringizga saqlang.

# swipeLeftDescription
source: Not your style? Swipe left to see the next item.
uz: Sizning stilingiz emasmi? Keyingi mahsulotni ko'rish uchun chapga suring.

source: Skip Tutorial
uz: O'qituvni o'tkazib yuborish

source: Pants
uz: Shimlar

source: Jackets
uz: Kurtkalar

# colorBlack
source: Black
uz: Qora

# colorWhite
source: White
uz: Oq

# colorGray
source: Gray
uz: Kulrang

# colorNavy
source: Navy
uz: To'q ko'k

# colorBlue
source: Blue
uz: Ko'k

# colorLightBlue
source: Light Blue
uz: Ochiq ko'k

# colorDarkBlue
source: Dark Blue
uz: To'q ko'k

# colorRed
source: Red
uz: Qizil

# colorPink
source: Pink
uz: Pushti

# colorGreen
source: Green
uz: Yashil

# colorBrown
source: Brown
uz: Jigarrang

# colorBeige
source: Beige
uz: Bej

# colorPurple
source: Purple
uz: Binafsha

# colorYellow
source: Yellow
uz: Sariq

# colorOrange
source: Orange
uz: To'q sariq

# colorCream
source: Cream
uz: Qaymoq

# materialCotton
source: Cotton
uz: Paxta

# materialSilk
source: Silk
uz: Ipak

# materialLinen
source: Linen
uz: Zig'ir

# materialWool
source: Wool
uz: Jun

# materialChiffon
source: Chiffon
uz: Shifon

# materialLeather
source: Leather
uz: Teri

# seasonSpring
source: Spring
uz: Bahor

# seasonSummer
source: Summer
uz: Yoz

# seasonFall
source: Fall/Autumn
uz: Kuz

# seasonWinter
source: Winter
uz: Qish

# seasonAllSeason
source: All Season
uz: Barcha fasllar

# fitLoose
source: Loose
uz: Keng

# fitRegular
source: Regular
uz: Oddiy

# fitSlim
source: Slim
uz: Tor

# fitOversized
source: Oversized
uz: Juda keng

# fitSuperSlim
source: Super Slim
uz: Juda tor

# styleCasual
source: Casual
uz: Kundalik

# styleFormal
source: Formal
uz: Rasmiy

# styleSporty
source: Sporty
uz: Sport

# styleElegant
source: Elegant
uz: Nafis

# styleModest
source: Modest
uz: Kamtarin

# occasionDaily
source: Daily
uz: Kundalik

# occasionWork
source: Work
uz: Ish

# occasionWedding
source: Wedding
uz: To'y

# occasionParty
source: Parties
uz: Ziyofatlar

# occasionCasual
source: Casual
uz: Kundalik

# occasionFormal
source: Formal Events
uz: Rasmiy tadbirlar

# occasionPrayer
source: Prayer
uz: Namoz

source: Prefer not to say
uz: Aytishni istmayman

source: Not applicable
uz: Tegishli emas

# categoryDress
source: Dress
uz: Ko'ylak

# categoryHijab
source: Hijab
uz: Hijob

# categoryTunic
source: Tunic
uz: Tunika

# categoryTop
source: Top
uz: Ustki kiyim

# categoryBlouse
source: Blouse
uz: Bluza

# categoryShirt
source: Shirt
uz: Ko'ylak

# categoryPants
source: Pants
uz: Shim

# categoryJeans
source: Jeans
uz: Jinsi shim

# categorySkirt
source: Skirt
uz: Yubka

# categoryJacket
source: Jacket
uz: Kurtka

# categoryCoat
source: Coat
uz: Palto

# categoryCardigan
source: Cardigan
uz: Kardigan

# categorySweater
source: Sweater
uz: Sviter

# categoryActivewear
source: Activewear
uz: Sport kiyim

# categoryJumpsuit
source: Jumpsuit
uz: Kombinezon

# categoryScarf
source: Scarf
uz: Ro'mol

# categoryShawl
source: Shawl
uz: Shol

# categoryBags
source: Bags
uz: Sumkalar

# categoryUnderwear
source: Underwear
uz: Ichki kiyim

# categoryOuterwear
source: Outerwear
uz: Ustki kiyim

source: Modesty Level
uz: Kamtarinlik darajasi

# modestyLevelDescription
source: How would you prefer your clothing coverage?
uz: Kiyim qoplamini qanday afzal ko'rasiz?

source: Revealing
uz: Ochiq

# selectModestyError
source: Please select at least one modesty level
uz: Iltimos, kamida bitta kamtarinlik darajasini tanlang

# saveModestyError
source: Failed to save modesty level
uz: Kamtarinlik darajasini saqlashda xatolik yuz berdi

source: Select one or both preferences
uz: Bir yoki ikkala afzallikni tanlang

# selectMultipleOptions
source: You can select multiple options
uz: Siz bir nechta variantni tanlashingiz mumkin

# whichColorsAvoid
source: Which colors do you want to avoid?
uz: Qaysi ranglardan qochmoqchisiz?

# selectColorsAvoid
source: Select colors you prefer not to wear
uz: Kiyishni istamagan ranglarni tanlang

# colorReds
source: Reds
uz: Qizil ranglar

# colorPinks
source: Pinks
uz: Pushti ranglar

# colorOranges
source: Oranges
uz: To'q sariq ranglar

# colorYellows
source: Yellows
uz: Sariq ranglar

# colorGreens
source: Greens
uz: Yashil ranglar

# colorBlues
source: Blues
uz: Moviy ranglar

# colorPurples
source: Purples
uz: Binafsha ranglar

# colorBrowns
source: Browns
uz: Jigarrang ranglar

# colorBeiges
source: Beiges
uz: Och jigarrang ranglar

# colorGrays
source: Grays
uz: Kulrang ranglar

# colorWhites
source: Whites
uz: Oq ranglar

# colorBlacks
source: Blacks
uz: Qora ranglar

source: Style Categories
uz: Uslub kategoriyalari

# styleCategoriesDescription
source: Choose the styles that match your personality
uz: Shaxsingizga mos keladigan uslublarni tanlang

source: Casual
uz: Kundalik

source: Formal
uz: Rasmiy

source: Business
uz: Ishbilarmon

source: Elegant
uz: Nafis

source: Vintage
uz: Vintaj

source: Modern
uz: Zamonaviy

source: Classic
uz: Klassik

source: Modest
uz: Kamtar

source: Romantic
uz: Romantik

source: Occasions
uz: Tadbirlar

# occasionsDescription
source: Select the occasions you typically dress for
uz: Odatda qaysi holatlar uchun kiyinishingizni tanlang

# occasionStudy
source: Study
uz: O'qish

# occasionReligious
source: Religious Events
uz: Diniy tadbirlar

# occasionSports
source: Sports
uz: Sport

# occasionTravel
source: Travel
uz: Sayohat

# occasionOutdoor
source: Outdoor Activities
uz: Faol dam olish

# occasionSpecial
source: Special Occasions
uz: Maxsus holatlar

source: Brand Preferences
uz: Brend afzalliklari

# brandPreferencesDescription
source: Choose your favorite brands (optional)
uz: Sevimli brendlaringizni tanlang (ixtiyoriy)

# optionalSelection
source: You can skip this step
uz: Bu qadamni o'tkazib yuborishingiz mumkin

# selectAtLeastOne
source: Please select at least one option
uz: Iltimos, kamida bitta variantni tanlang

# genericError
source: An error occurred. Please try again.
uz: Xatolik yuz berdi. Iltimos, qaytadan urinib ko'ring.

source: Profile Information
uz: Profil ma'lumotlari

source: Personal
uz: Shaxsiy

source: Hijab Preference
uz: Hijob tanlovi

source: Age
uz: Yosh

source: years
uz: yosh

source: Body Information
uz: Tana ma'lumotlari

source: Clothing Sizes
uz: Kiyim o'lchamlari

source: Top Size
uz: Yuqori kiyim o'lchami

source: Bottom Size
uz: Pastki kiyim o'lchami

source: Dress Size
uz: Ko'ylak o'lchami

source: Jean Waist Size
uz: Jins bel o'lchami

source: Bra Sizes
uz: Byustgalter o'lchamlari

# braBandSize
source: Band Size
uz: Kamar o'lchami

# braCupSize
source: Cup Size
uz: Chashka o'lchami

# stylePreferenceLabel
source: Style Preference
uz: Stil tanlovi

source: Budget Type
uz: Byudjet turi

source: Shopping Preferences
uz: Xarid qilish tanlovlari

source: Budget
uz: Byudjet

source: Completed
uz: Bajarilgan

source: Not Completed
uz: Bajarilmagan

source: From
uz: Dan

source: Up to
uz: Gacha

source: Not set
uz: O'rnatilmagan

# enumFemale
source: Female
uz: Ayol

# enumMale
source: Male
uz: Erkak

# enumHourglass
source: Hourglass
uz: Qum soati

# enumTriangle
source: Triangle
uz: Uchburchak

# enumRectangle
source: Rectangle
uz: To'rtburchak

# enumHeart
source: Heart
uz: Yurak

# enumPreferNotToSay
source: Prefer not to say
uz: Aytishni xohlamayman

# enumCovered
source: Covered
uz: Yopiq

# enumUncovered
source: Uncovered
uz: Ochiq

# enumNotApplicable
source: Not Applicable
uz: Tegishli emas

# enumLoose
source: Loose
uz: Keng

# enumRegular
source: Regular
uz: Oddiy

# enumOversized
source: Oversized
uz: Juda katta

# enumSlim
source: Slim
uz: Tor

# enumSuperSlim
source: Super Slim
uz: Juda tor

# enumFitted
source: Fitted
uz: O'lchamli

# enumModerate
source: Moderate
uz: O'rtacha

# enumRevealing
source: Revealing
uz: Ochiq

# enumBudget
source: Budget
uz: Byudjet

# enumLuxury
source: Luxury
uz: Hashamatli

# enumFlexible
source: Flexible
uz: Moslashuvchan

# enumCasual
source: Casual
uz: Kundalik

# enumFormal
source: Formal
uz: Rasmiy

# enumBusiness
source: Business
uz: Biznes

# enumSporty
source: Sporty
uz: Sport

# enumElegant
source: Elegant
uz: Nafis

# enumBohemian
source: Bohemian
uz: Bogemiya

# enumVintage
source: Vintage
uz: Vintaj

# enumModern
source: Modern
uz: Zamonaviy

# enumClassic
source: Classic
uz: Klassik

# enumTrendy
source: Trendy
uz: Trend

# enumModest
source: Modest
uz: Kamtar

# enumStreetwear
source: Streetwear
uz: Ko'cha

# enumRomantic
source: Romantic
uz: Romantik

# enumEdgy
source: Edgy
uz: Dadil

# enumPreppy
source: Preppy
uz: Preppi

# enumAthleisure
source: Athleisure
uz: Sport-chic

# enumChic
source: Chic
uz: Chiroyli

# enumGlamorous
source: Glamorous
uz: Ajoyib

# enumSexy
source: Sexy
uz: Jozibali

# enumGrunge
source: Grunge
uz: Granj

# enumGothic
source: Gothic
uz: Gotik

# enumHippie
source: Hippie
uz: Xippi

# enumArtsy
source: Artsy
uz: San'atkor

# enumFeminine
source: Feminine
uz: Ayollik

# enumMasculine
source: Masculine
uz: Erkaklik

# enumAndrogynous
source: Androgynous
uz: Androgin

# enumLuxurious
source: Luxurious
uz: Hashamatli
